#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
module.keycloak_test.module.onestopauth.module.client_test-3-08-10-2021-465.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=d27d28c5-7397-41d1-a0fc-47408d5661a2]
module.keycloak_test.module.onestopauth.module.client_jon-test-12-473.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=92e282b0-c5ef-441c-a41a-e1a62622eadb]
module.keycloak_test.module.onestopauth.module.client_jon-test-12-473.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=4dd87ed1-cde7-438f-bc65-9cb1eb1c8801]
module.keycloak_test.module.onestopauth.module.client_jon-test-12-473.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=99dc2e7d-7c85-42f9-abe7-b30465736841]
module.keycloak_test.module.onestopauth.module.client_jon-test-12-473.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=bed71036-9310-4a04-a93c-c9110accee57]
module.keycloak_test.module.onestopauth.module.client_6-test-for-release-v-1-70.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=2e8f9fa0-bd63-42e3-b18e-c1fe89faec68]
module.keycloak_test.module.onestopauth.module.client_6-test-for-release-v-1-70.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=1dd0a803-1faa-4f01-809a-4c82d3e267d5]
module.keycloak_test.module.onestopauth.module.client_6-test-for-release-v-1-70.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=30012bbe-3dbf-4a5b-95d3-f0828b00ea1c]
module.keycloak_test.module.onestopauth.module.client_jon-test-2-265.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=1e58118d-fa84-483c-9ef4-8f4fc9babca1]
module.keycloak_test.module.onestopauth.module.client_jon-test-2-265.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=9cfda236-b8b9-49d1-a795-ebf03473b130]
module.keycloak_test.module.onestopauth.module.client_jon-test-6-337.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=acaf055b-7a1c-4cff-9e79-5660e0cd5a9f]
module.keycloak_test.module.onestopauth.module.client_jon-test-6-337.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=61b51f18-b6ea-4162-a0f4-e6e96efbb50d]
module.keycloak_test.module.onestopauth.module.client_jon-test-6-337.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=8f13013d-2f89-4d34-bc28-92f8bc2f8aec]
module.keycloak_test.module.onestopauth.module.client_jon-test-2-265.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=bf540b0b-b981-49f0-aedf-1ca62f20f9bf]
module.keycloak_test.module.onestopauth.module.client_jon-test-2-265.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=4df2f0b2-1990-4cb9-9f3d-fdac07d20d4a]
module.keycloak_test.module.onestopauth.module.client_jon-test-6-337.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=01e07da7-c7dc-4cf3-9d39-e6d3b818f3b5]
module.keycloak_test.module.onestopauth.module.client_jon-test-2-265.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=ba8026bb-2e4c-49af-b35e-dd2783e95ebb]
module.keycloak_test.module.onestopauth.module.client_jon-test-6-337.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=ebf7510b-2c8d-4823-a842-1ef2e5d422c7]
module.keycloak_test.module.onestopauth.module.client_jon-test-2-265.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=39bd98c2-f668-4ea4-a15c-d32916a6703a]
module.keycloak_test.module.onestopauth.module.client_jon-test-6-337.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=c2e355e0-b52f-49b2-a0fd-8e45f14623e9]
module.keycloak_test.module.onestopauth.module.client_test-2-08-09-2021-332.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=bf745114-72b7-4eef-a6b7-1280ac5330e2]
module.keycloak_test.module.onestopauth.module.client_test-2-08-09-2021-332.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=5453fa64-0eb4-43b1-8304-3efdad04aac0]
module.keycloak_test.module.onestopauth.module.client_test-2-08-09-2021-332.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=b00afd3a-9b76-43ce-9e34-cfb05071c8f2]
module.keycloak_test.module.onestopauth.module.client_project-sso-1189.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=be743407-a68d-4884-8fcd-8e7f001c498a]
module.keycloak_test.module.onestopauth.module.client_test-2-08-09-2021-332.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=60037fdc-5984-4338-a1d2-ab18d803f7dc]
module.keycloak_test.module.onestopauth.module.client_test-2-08-09-2021-332.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=e4ad53bd-0fb8-42ca-bd95-3d5d0cbb1b23]
module.keycloak_test.module.onestopauth.module.client_test-2-08-09-2021-332.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=d5c93604-e0e3-4740-9584-84b066ab9120]
module.keycloak_test.module.onestopauth.module.client_project-sso-1189.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=a5699e37-7e75-4e45-87bd-f20b83d36a07]
module.keycloak_test.module.onestopauth.module.client_test-133.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=00008b11-5f5a-49ae-a363-005a4c03fe85]
module.keycloak_test.module.onestopauth.module.client_project-sso-1189.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=23e19935-0f75-430e-9c3f-45fd9bff3a8c]
module.keycloak_test.module.onestopauth.module.client_project-sso-1189.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=184f6b7b-3bd8-428f-9b40-ecf2fecbeb44]
module.keycloak_test.module.onestopauth.module.client_project-sso-1189.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=d9ff6313-c7b8-4964-a146-23a2d768869f]
module.keycloak_test.module.onestopauth.module.client_test-133.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=4d120e83-a391-470d-a517-5ad8a2c04441]
module.keycloak_test.module.onestopauth.module.client_test-133.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=956a3f2f-5e6d-4f83-aa15-2f22e226d9f3]
module.keycloak_test.module.onestopauth.module.client_test-133.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=f2a2fb12-422f-4b4c-b5ff-34f14cbd625d]
module.keycloak_test.module.onestopauth.module.client_test-133.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=f1b20d23-2966-492a-819e-6f7890a7961f]
module.keycloak_test.module.onestopauth.module.client_project-sso-1189.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=08666c45-3e33-4762-9f16-3e5ecff439ac]
module.keycloak_test.module.onestopauth.module.client_test-133.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=a6acba35-105c-436c-adbe-e84aadb2642c]
module.keycloak_test.module.onestopauth.module.client_test-5-08-09-2021-338.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=bec9b68d-164e-431a-9bf5-0561bf500918]
module.keycloak_test.module.onestopauth.module.client_test-5-08-09-2021-338.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=a2f017db-b2a3-4268-8eca-d00780a0fbee]
module.keycloak_test.module.onestopauth.module.client_test-5-08-09-2021-338.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=41c46f80-61a5-491e-9fa7-1f9b07bb9e24]
module.keycloak_test.module.onestopauth.module.client_test-5-08-09-2021-338.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=a7bad6d8-cc3c-4763-bdbe-9cf77cf18e1f]
module.keycloak_test.module.onestopauth.module.client_test-5-08-09-2021-338.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=eb404028-dc05-4845-ba5d-c639101b3d5b]
module.keycloak_test.module.onestopauth.module.client_test-5-08-09-2021-338.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=8107ee32-87f3-41eb-bb21-3df0944b94b8]
module.keycloak_test.module.onestopauth.module.client_jon-test-12-466.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=14f3dc3a-cfcd-436b-b267-2a181961b625]
module.keycloak_test.module.onestopauth.module.client_jon-test-12-466.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=0964a154-2cf8-4eed-a061-8c5b8839090b]
module.keycloak_test.module.onestopauth.module.client_jon-test-12-466.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=5e43537d-44da-4dd0-9627-c97d2b19ecc6]
module.keycloak_test.module.onestopauth.module.client_jon-test-12-466.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=75c5ce43-21c0-4adc-9c88-b67094370396]
module.keycloak_test.module.onestopauth.module.client_jon-test-12-466.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=30f6ac74-bca2-47bd-af4e-e99340d9f388]
module.keycloak_test.module.onestopauth.module.client_jon-test-12-466.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=11740a6d-e1bc-4358-b69b-d20c40ad6ede]
module.keycloak_test.module.onestopauth.module.client_aug-17-test-email-596.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=3f59bd00-3986-404a-956b-12c9d4bc0a2a]
module.keycloak_test.module.onestopauth.module.client_aug-17-test-email-596.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=1abddc22-2004-4541-ae56-b3d3043598d2]
module.keycloak_test.module.onestopauth.module.client_aug-17-test-email-596.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=25f76ff9-6fe1-4cfd-bb95-cfce03654e34]
module.keycloak_test.module.onestopauth.module.client_aug-17-test-email-596.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=a7e342e5-ee7d-40ba-aebe-c6ca3d5739f1]
module.keycloak_test.module.onestopauth.module.client_aug-17-test-email-596.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=8b085dc0-1114-49fb-a5ef-b1bd11a9ad37]
module.keycloak_test.module.onestopauth.module.client_aug-17-test-email-596.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=b4969680-f1bd-4168-b6c7-88335fb38b0f]
module.keycloak_test.module.onestopauth.module.client_automergetestjun-1.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=35797f78-539e-4102-8429-430d2bf6ee33]
module.keycloak_test.module.onestopauth.module.client_automergetestjun-1.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=d62ae980-fdab-4e27-9975-f07113f1abb1]
module.keycloak_test.module.onestopauth.module.client_automergetestjun-1.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=b817d154-46b3-4078-a50c-5765d259e5b3]
module.keycloak_test.module.onestopauth.module.client_automergetestjun-1.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=3a6e647f-57d7-432f-8cf6-a96be9ff1bef]
module.keycloak_test.module.onestopauth.module.client_automergetestjun-1.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=df2519c4-4fd4-460c-87c5-0ab8f55ed1e0]
module.keycloak_test.module.onestopauth.module.client_automergetestjun-1.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=2f1a394e-5a59-45bb-a53e-bb69f90eb0bd]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.keycloak_dev.module.onestopauth.module.client_test-project-1260.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_test-project-1260.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_test-project-1260.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_test-project-1260.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "test-project-1260"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_test-project-1260.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_test-project-1260.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_test-project-1260.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "CONFIDENTIAL"
      + client_id                                = "test-project-1260"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = true
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "test-project-1260"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://test",
        ]
    }

  # module.keycloak_prod.module.onestopauth.module.client_test-project-1260.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_test-project-1260.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_test-project-1260.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_test-project-1260.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "test-project-1260"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_test-project-1260.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_test-project-1260.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_test-project-1260.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "CONFIDENTIAL"
      + client_id                                = "test-project-1260"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = true
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "test-project-1260"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://test",
        ]
    }

  # module.keycloak_test.module.onestopauth.module.client_test-project-1260.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_test-project-1260.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_test-project-1260.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_test-project-1260.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "test-project-1260"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_test-project-1260.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_test-project-1260.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_test-project-1260.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "CONFIDENTIAL"
      + client_id                                = "test-project-1260"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = true
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "test-project-1260"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://test",
        ]
    }

Plan: 21 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_env" but a value
│ was found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_aws_account_id"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 0 of 1883 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @junmin-bcgov, Action: `pull_request`*